import React, { useState } from "react";
import { FaFacebook, FaTwitter } from "react-icons/fa";

export default function etika() {
    return (
        <>
            <div className="flex flex-col justify-center w-[1000px] ml-[200px]">
                <h1 className="text-[#2C3843]">Գործարար Էթիկա և Կոմպլայենս</h1>
                <p className="mt-[20px] text-[#2C3843]"> «Տելեկոմ Արմենիա» ԲԲԸ-ն արժևորում է բաց, ազնիվ և թափանցիկ գործարար հարաբերություններն ու փոխադարձ վստահությունը բոլորի՝ հաճախորդների, աշխատակիցների, գործընկերների հետ: Այդ մշակույթի պահպանումն ապահովելու նպատակով էլ Ընկերությունում ներդրված են կորպորատիվ էթիկայի և կոմպլայենսի միջազգային բարձրագույն ստանդարտներ: Դրանք ամփոփված են մի շարք էթիկական ուղեցույցներում, որոնք հստակ նկարագրում են մեր գործունեության չափորոշիչները և ակնկալիքները։</p>
                <p className="mt-[20px] text-[#2C3843]">Մենք վստահ ենք, որ այսօրվա բարձր մրցակցային շուկայում Ընկերությունը կարող է հաջողության հասնել միայն հավատարիմ մնալով մեր արժեքներին և էթիկական վարքագծին: «Տելեկոմ Արմենիա» ԲԲԸ-ի երկարաժամկետ հեռանկարն է հարափոփոխ աշխարհում գնահատել և  մշտապես պաշտպանել մեր Ընկերության հեղինակությունը՝ որպես վստահելի և պատասխանատու գործընկերոջ: Մենք ցանկանում ենք, որ մեր աշխատակիցները, գործընկերները և հաճախորդները նույնպես կիսեն մեր այս արժեքները:</p>
                <h2 className="text-[#666E75] text-[35px] mt-[100px]">Վարվելակերպի կանոնակարգ</h2>
                <p className="text-[#2C3843]">Մեր բարոյական սկզբունքները և վարվելակերպի ստանդարտները արտացոլված են Ընկերության «Վարվելակերպի կանոնակարգում», որը հանդիսանում է Ընկերության արժեքների հիմնարար ուղեցույցը։ Մեր բոլոր աշխատակիցները՝ անկախ զբաղեցրած հաստիքից և պատասխանատվության սահմաններից, ինչպես նաև բոլոր երրորդ անձինք, ովքեր հանդես են գալիս Ընկերության անունից, պարտավոր են հետևել Կանոնակարգի պահանջներին:</p>
                <a href="https://www.telecomarmenia.am/file_manager/Code%20of%20Conduct/%D5%8E%D5%A1%D6%80%D5%BE%D5%A5%D5%AC%D5%A1%D5%AF%D5%A5%D6%80%D5%BA%D5%AB%20%D5%AF%D5%A1%D5%B6%D5%B8%D5%B6%D5%A1%D5%AF%D5%A1%D6%80%D5%A3%20v.0.3.pdf" className="text-[#5D4C9A] mt-[15px] text-[25px]">Վարվելակերպի կանոնակարգ(փաստաթուղթ )</a>
                <h2 className="text-[#666E75] text-[35px] mt-[100px]">Speak-Up թեժ գիծ</h2>
                <p className="mt-[20px] text-[#2C3843]">«Տելեկոմ Արմենիա» ԲԲԸ-ն վարում է մտահոգությունների բարձրաձայնման առցանց կառավարման համակարգ։ Եթե Ձեզ հայտնի են պոտոնցիալ կամ տեղի ունեցած չարաշահումներ, ինչպես նաև Ընկերության գործունեության ոլորտը կարգավորող օրենսդրության խախտումների վերաբերյալ տվյալներ, Դուք կարող եք բարձրաձայնել այդ մասին թողնելով համապատասխան հայտ ներքոհիշյալ հղմամբ։ «Տելեկոմ Արմենիա» ԲԲԸ-ն ձեռնարկում է բոլոր անհրաժեշտ քայլերը՝ գաղտնիության և անանունության սկզբունքի պահպանման համար, համաձայն գործող օրենսդրության։</p>
                <a href="https://speakup.telecomarmenia.am/" className="text-[#5D4C9A] mt-[15px] text-[25px]">Speak-Up առցանց հարթակ</a>

                {/* kisvel */}
                      <div className="mt-8 pt-4 border-t border-slate-200 flex items-center gap-4">
                        <a href="#" className="text-slate-700 hover:text-[#1877f2] transition-colors">
                          <FaFacebook size={18} />
                        </a>
                        <a href="#" className="text-slate-700 hover:text-[#1da1f2] transition-colors">
                          <FaTwitter size={18} />
                        </a>
                      </div>
            </div>
        </>
    )
}