import React, { useState, useEffect, useCallback } from 'react';
import { FaFacebook, FaTwitter } from 'react-icons/fa';
import './merMasin.css';
import { Container } from 'react-bootstrap';


export default function merMasin() {
return (
      <>
      <div className='mermasin'>
        <h1>Մեր մասին</h1>
        <p>Տելեկոմ Արմենիա ԲԲԸ-ն (ապրանքանիշը՝ Team Telecom Armenia) հայկական ընկերություն է, որը առաջատար դիրք է զբաղեցնում երկրի հեռահաղորդակցության և տեղեկատվական տեխնոլոգիաների ոլորտներում։</p>
        <p>Հանդիսանալով Հայաստանում առաջին տելեկոմ ցանցի ժառանգորդը՝ ընկերությունն ունի ոլորտում ծառայությունների մատուցման ավելի քան 100 տարվա պատմություն։ Այս հարուստ փորձի և ժամանակակից տեխնոլոգիաների համադրության շնորհիվ՝ Team-ը հուսալի և նորարար ծառայություններ է տրամադրում թե՛ անհատ, թե կորպորատիվ բաժանորդներին։ </p>
        <p>Ընկերությունը ՀՀ տարածքում տրամադրում է բջջային և ֆիքսված ինտերնետի, թվային հեռուստատեսության, բջջային և ֆիքսված հեռախոսակապի ծառայություններ, որոնց բարձր որակն ապահովելու նպատակով Team-ը 2021 թվականին մեկնարկեց իր ռազմավարական նախագիծը՝ տարածաշրջանում եզակի՝ 25 Գբ/վ թողունակությամբ (NGN, Next Generation Network) ցանցի կառուցումը։ Nokia-ի հետ համագործակցությամբ իրականացվող այս ծրագրի արդյունքում ցանցն արդեն հասանելի է Երևանի և մարզերի ավելի քան 330 000 տնային տնտեսության: Առաջիկայում այս ցանցը որակյալ կապով և ինտերնետով կապահովի Հայաստանի բոլոր բնակիչներին։</p>
        <p>Ինտերնետի հուսալիության և անվտանգության մակարդակը Հայաստանում բարձրացնելու, ինչպես նաև երկրի կախվածությունն արտերկրում տեղի ունեցող վթարներից նվազեցնելու համար, Team-ը 2024 թ․-ի սկզբին գործարկել է երրորդ միջազգային կապուղին ավելի քան 1 Տբ/վ թողունակությամբ, որը Հայաստանը Եվրոպայի ամենամեծ տվյալների փոխանակման կենտրոնին՝ Ֆրանկֆուրտին կապում է նոր՝ այլընտրանքային ճանապարհով։</p>
        <p>Ընկերությունը հիմնովին վերազինել և բարելավել է նաև DWDM ցանցը, ինչը Մերձավոր Արևելքի տարանցիկ կապուղիների և ինտերնետի վաճառքի շուկա մուտք գործելու հնարավորություն է ընձեռել։ Կարճ ժամանակահատվածում Team-ը դարձավ այդ ուղղությամբ ինտերնետ արտահանող խոշորագույն ընկերություններից մեկը՝ ծառայություններ մատուցելով Մերձավոր Արևելքի 5 երկրների։ </p>
        <p>էլեկտրական մեքենաների օգտագործումը Հայաստանում խթանելու և ավելի հեշտ, անխոչընդոտ ու հաճելի դարձնելու նպատակով Team Telecom Armenia-ն կառուցում է Team Energy արագ լիցքավորման կայանների ցանցը Հայաստանի ողջ տարածքում։ Նորարարական լուծումներով այս ցանցի զարգացումը դրական ազդեցություն կունենա նաև շրջակա միջավայրի վրա։</p>
        <p>«Տելեկոմ Արմենիա» ԲԲԸ-ն առաջին տելեկոմ ընկերությունն է, որը Հայաստանում իրականացրել է բաժնետոմսերի առաջնային հրապարակային տեղաբաշխում (IPO)՝ դառնալով է՛լ ավելի բաց ու հանրային։ Ընկերության բաժնետոմսերը ցուցակված են Հայաստանի ֆոնդային բորսայում։</p>
        <p>Կորպորատիվ սոցիալական պատասխանատվության շրջանակներում ընկերությունն աջակցում է տեխնոլոգիական, կրթական ու գիտական, ինչպես նաև բնապահպանական նախագծերի իրագործմանը, նպաստում հայկական բովանդակության ստեղծմանն ու տարածմանը, մարզերի զարգացմանը ու թիմային ոգին խրախուսող մարզաձևերի ու նախաձեռնությունների իրականացմանը:</p>
      </div>
      <div className='kisvel'>
        <a href="">Կիսվել</a>
        <a href="#fb" className="footer-social-icon"><FaFacebook size={20} color='blue'/></a>
        <a href="#tw" className="footer-social-icon"><FaTwitter size={20} color='blue'/></a>
      </div>
      </>
    );
}